# Data Frame Creation and Manipulation
### Abeer Sethia | 220968144 | Week 1 | Exercise 1

1. Create Python program to find the average of 10 numbers using while loop
2. Create Python program to find the geometric mean of n numbers
3. Create Python program to check whether the given integer is a prime number or not
4. Create Python program to implement linear search and implement binary search
5. Using math package, Create Python program to find the area of a triangle whose sides are given

EXERCISE 1: - Introduction to Pandas Data frame creation and manipulation
1. Create a data frame with details of 10 students and columns as Roll Number, Name, Gender, Marks1, Marks2, Marks3.
2. Create a new column with total marks
3. Find the lowest marks in Marks1
4. Find the Highest marks in Marks2
5. Find the average marks in Marks3
6. Find student name with highest average
7. Find how many students failed in Marks2 (<40)

### 1. Create a data frame with details of 10 students and columns as Roll Number, Name, Gender, Marks1, Marks2, Marks3.

In [1]:
import pandas as pd
import numpy as np

data = [[1, 'Abeer', 'Male', 38, 86, 91], [2, 'Ananya', 'Female', 32, 26, 94], [3, 'Aditya', 'Male', 72, 24, 100], [4, 'Reeva', 'Female', 82, 83, 64], [5, 'Saanvi', 'Female', 32, 56, 94],[6, 'Amruni', 'Female', 32, 56, 94],[7, 'Anant', 'Male', 32, 56, 94],[8, 'Apporva', 'Female', 32, 56, 94],[9, 'Snehansh', 'Male', 32, 16, 94],[10, 'Shobhit', 'Male', 32, 28, 94]]
df = pd.DataFrame(data, columns=[ 'Roll Number', 'Name', 'Gender', 'Marks1', 'Marks2', 'Marks3'])

print(df)

   Roll Number      Name  Gender  Marks1  Marks2  Marks3
0            1     Abeer    Male      38      86      91
1            2    Ananya  Female      32      26      94
2            3    Aditya    Male      72      24     100
3            4     Reeva  Female      82      83      64
4            5    Saanvi  Female      32      56      94
5            6    Amruni  Female      32      56      94
6            7     Anant    Male      32      56      94
7            8   Apporva  Female      32      56      94
8            9  Snehansh    Male      32      16      94
9           10   Shobhit    Male      32      28      94

### 2. Create a new column with total marks

In [2]:
df['Total_Marks'] = df['Marks1']+df['Marks2']+df['Marks3']
df

   Roll Number      Name  Gender  Marks1  Marks2  Marks3  Total_Marks
0            1     Abeer    Male      38      86      91          215
1            2    Ananya  Female      32      26      94          152
2            3    Aditya    Male      72      24     100          196
3            4     Reeva  Female      82      83      64          229
4            5    Saanvi  Female      32      56      94          182
5            6    Amruni  Female      32      56      94          182
6            7     Anant    Male      32      56      94          182
7            8   Apporva  Female      32      56      94          182
8            9  Snehansh    Male      32      16      94          142
9           10   Shobhit    Male      32      28      94          154

### 3. Find the lowest marks in Marks1

In [3]:
minmarks=df.Marks1.min()
print(minmarks)

32

### 4. Find the highest marks in Marks2

In [4]:
maxmarks=df.Marks2.max()
print(maxmarks)

86

### 5. Find the average marks in Marks3

In [5]:
avgmarks=df.Marks3.mean()
print(avgmarks)

91.3

### 6. Find student name with highest average

In [6]:
df['Average_Marks'] = (df['Marks1']+df['Marks2']+df['Marks3'])/3
df

,Roll Number,Name,Gender,Marks1,Marks2,Marks3,Total_Marks,Average_Marks
0,1,Abeer,Male,38,86,91,215,71.666667
1,2,Ananya,Female,32,26,94,152,50.666667
2,3,Aditya,Male,72,24,100,196,65.333333
3,4,Reeva,Female,82,83,64,229,76.333333
4,5,Saanvi,Female,32,56,94,182,60.666667
5,6,Amruni,Female,32,56,94,182,60.666667
6,7,Anant,Male,32,56,94,182,60.666667
7,8,Apporva,Female,32,56,94,182,60.666667
8,9,Snehansh,Male,32,16,94,142,47.333333
9,10,Shobhit,Male,32,28,94,154,51.333333

In [7]:
df[df.Average_Marks==df.Average_Marks.max()].Name

3    Reeva
Name: Name, dtype: object

### 7. Find how many students failed in Marks2 (<40)

In [9]:
df["Result"]=df.Marks2.apply(lambda x : 'Fail'  if x<40 else 'Pass')
count=df.Result.value_counts()["Fail"]
print ("No of students failing Marks 2 is",count)

No of students failing Marks 2 is 4